taskt/Core/Automation/Commands/DictionaryGroup/IDictionaryKeyActionProperties_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.IDictionaryKeyActionProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.ADictionaryKeyActionCommands" [ label="ADictionaryKeyActionCommands", style="dashed", ];
"taskt.Core.Automation.Commands.IDictionaryKeyActionProperties" [ label="IDictionaryKeyActionProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.RemoveDictionaryItemCommand" [ label="RemoveDictionaryItemCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SetDictionaryValueCommand" [ label="SetDictionaryValueCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetDictionaryValueCommand" [ label="GetDictionaryValueCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.ADictionaryKeyActionCommands" -> "taskt.Core.Automation.Commands.IDictionaryKeyActionProperties";
"taskt.Core.Automation.Commands.RemoveDictionaryItemCommand" -> "taskt.Core.Automation.Commands.ADictionaryKeyActionCommands";
"taskt.Core.Automation.Commands.SetDictionaryValueCommand" -> "taskt.Core.Automation.Commands.ADictionaryKeyActionCommands";
"taskt.Core.Automation.Commands.GetDictionaryValueCommand" -> "taskt.Core.Automation.Commands.ADictionaryKeyActionCommands";
}
